# Built In Failures Toposolid Boolean Perturbation Failures Non Perturbation Boolean Failed Property

Source: https://www.revitapidocs.com/2026/fdc4a40f-b893-3b48-b14a-19f82591a4f4.htm

---

| Built In Failures Toposolid Boolean Perturbation Failures Non Perturbation Boolean Failed Property |
| --- |

Boolean operation failed without perturbation.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static FailureDefinitionId NonPerturbationBooleanFailed { get; }
```

```
Public Shared ReadOnly Property NonPerturbationBooleanFailed As FailureDefinitionId
	Get
```

```
public:
static property FailureDefinitionId^ NonPerturbationBooleanFailed {
	FailureDefinitionId^ get ();
}
```

```
static member NonPerturbationBooleanFailed : FailureDefinitionId with get
```

#### Property Value

FailureDefinitionId See Also

#### Reference

BuiltInFailures ToposolidBooleanPerturbationFailures Class Autodesk.Revit.DB Namespace